#!/usr/bin/env python
# -*- coding:utf-8 -*-


import random


class GetData():
    random_data = ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9",
                   "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t",
                   "u", "v", "w",
                   "x", "y", "z",
                   "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T",
                   "U", "V", "W",
                   "X", "Y", "Z"]
    dept_name = ['何运浩', '陈鸿德', '孙德运', '郑承允', '杨宣朗', '吕鸿轩', '施曜曦', '李德明', '卫曜坤', '周瀚彭', '陈昌燎']
    dept_data = {'何运浩': '运营部', '陈鸿德': '绩效部', '孙德运': '技术部', '郑承允': '测试部', '杨宣朗': '人事部', '吕鸿轩': '人事部', '施曜曦': '人事部',
                 '李德明': '运营部', '卫曜坤': '技术部', '周瀚彭': '技术部', '陈昌燎': '测试部'}

    uid = ['1b42d303-cbe7-5c72-bb14-1a6b1e5bb2da', '7bee0021-cbff-577c-8f4a-f04bc4d65bf4',
           '435ac6ec-3c35-5892-bcbb-183b1c577a5b','af200de9-3767-59b7-ab30-bbcbc1231a0a','9efb434a-438c-51d7-ac49-b52b20508ecb']
    policy_data = {'1b42d303-cbe7-5c72-bb14-1a6b1e5bb2da': '2011版卫生部三级综合医院评审标准实施细则',
                   '7bee0021-cbff-577c-8f4a-f04bc4d65bf4': '2020版卫生部三级综合医院评审标准实施细则',
                   '435ac6ec-3c35-5892-bcbb-183b1c577a5b': '临床用血质量控制指标（2019 年版）',
                   'af200de9-3767-59b7-ab30-bbcbc1231a0a': '国家三级公立医院绩效考核操作手册',
                   '9efb434a-438c-51d7-ac49-b52b20508ecb': '国家二级公立医院绩效考核操作手册'}
